In [1]:
import numpy as np
import pandas as pd

In [3]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [4]:
arr

array([10, 20, 30])

In [5]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data = my_data, index = label)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_data, label)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(arr, label)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(d)['b']

20

In [19]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [21]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [22]:
ser1['USA']

1

In [24]:
ser3 = pd.Series(label)
ser3

0    a
1    b
2    c
dtype: object

In [25]:
ser3[2]

'c'

In [26]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [27]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [29]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [30]:
ser2 + ser1

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [31]:
# DATAFRAMES

In [32]:
import numpy as np
import pandas as pd

In [33]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [37]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [38]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [39]:
df.Z

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: Z, dtype: float64

In [62]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752

In [63]:
df['new'] = df['W'] + df['Y']

In [64]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [65]:
df1 = df.drop('new', axis=1)

In [66]:
df1

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [67]:
df.drop('new', axis=1, inplace=True)

In [68]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [71]:
df.shape

(4, 4)

In [72]:
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [73]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [76]:
df.loc['B', 'Y']

0.16690463609281317

In [77]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [78]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [79]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True

In [80]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752

In [82]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
Name: W, dtype: float64

In [83]:
df['W'] > 0

A     True
B    False
C     True
D    False
Name: W, dtype: bool

In [84]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [85]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [86]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [88]:
resultdf = df[df['W']>0]

In [89]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [90]:
resultdf['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [91]:
df[ (df['W'] > 0) & (df['Y'] < 1) ] # AND operator

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [92]:
df[ (df['W'] > 0) | (df['Y'] < 1) ] # OR operator

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [93]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752

In [96]:
newind = 'CA NY WY OR'.split()
newind

['CA', 'NY', 'WY', 'OR']

In [98]:
df['State'] = newind

In [99]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR

In [100]:
df.set_index('State')

              W         X         Y         Z
State
CA     0.302665  1.693723 -1.706086 -1.159119
NY    -0.134841  0.390528  0.166905  0.184502
WY     0.807706  0.072960  0.638787  0.329646
OR    -0.497104 -0.754070 -0.943406  0.484752

In [102]:
df

          W         X         Y         Z State
A  0.302665  1.693723 -1.706086 -1.159119    CA
B -0.134841  0.390528  0.166905  0.184502    NY
C  0.807706  0.072960  0.638787  0.329646    WY
D -0.497104 -0.754070 -0.943406  0.484752    OR

In [103]:
import numpy as np
import pandas as pd

In [104]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [105]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [106]:
inside

[1, 2, 3, 1, 2, 3]

In [108]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [109]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [113]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [114]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [115]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [116]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [117]:
df.index.names

FrozenList([None, None])

In [118]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [119]:
df.loc['G2']

            A         B
Num
1   -1.133817  0.610478
2    0.386030  2.084019
3   -0.376519  0.230336

In [120]:
df.loc['G2'].loc[2]['B']

2.084018530338962

In [121]:
df.loc['G1']

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [122]:
df.xs('G1')

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [124]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.147027 -0.479448
G2     -1.133817  0.610478